Tutorials/3D/Cylinder-ss/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -3);

boundaryField
{
    "(inlet).*"
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 -3);
        value           uniform (0 0 -3);
    }

    ".*(outlet).*"
    {
        type            zeroGradient;
    }
    
    cylinder_front
    {
        type            slip;
    }

    cylinder_side
    {
        type            noSlip;
    }
}

// ************************************************************************* //



